using System.Collections.Generic;

namespace Siasm
{
    public class ItemOfNameMasterData
    {
        public Dictionary<int, string> NameDictionary = new Dictionary<int, string>()
        {
            // 1000番台：数が一つだけのもの
            { 1001, "AtoBデバイス" },
            { 1002, "セキュリティキー" },
            { 1003, "Sel" },
            { 1004, "AtoBデバイス拡張" },
            // 2000番台：数が複数あるもの
            { 2001, "エギド" },
            { 2002, "キャパシティアッパー" },
            // 3000番台
            // 自社関係
            { 3001, "クリシェミナ社の歴史資料1" },
            { 3002, "クリシェミナ社の歴史資料2" },
            { 3003, "クリシェミナ社の歴史資料3" },
            { 3004, "クリシェミナ社の歴史資料4" },
            { 3005, "クリシェミナ社の歴史資料5" },
            { 3006, "クリシェミナ社の歴史資料6" },
            { 3007, "クリシェミナ社の歴史資料7" },
            { 3008, "クリシェミナ社の歴史資料8" },
            { 3009, "クリシェミナ社の歴史資料9" },
            { 3010, "クリシェミナ社の歴史資料10" },
            // オーバーゲイル関係
            { 3011, "オーバーゲイルの歴史資料-序章-1" },
            { 3012, "オーバーゲイルの歴史資料-序章-2" },
            { 3013, "オーバーゲイルの歴史資料-序章-3" },
            { 3014, "オーバーゲイルの歴史資料-序章-4" },
            { 3015, "オーバーゲイルの歴史資料-序章-5" },
            { 3016, "オーバーゲイルの歴史資料-序章-6" },
            { 3017, "オーバーゲイルの歴史資料-序章-7" },
            { 3018, "オーバーゲイルの歴史資料-序章-8" },
            { 3019, "オーバーゲイルの歴史資料-序章-9" },
            { 3020, "オーバーゲイルの歴史資料-序章-10" },
            // ゼナアド関係
            { 3021, "ゼナアドの研究資料1" },
            { 3022, "ゼナアドの記録資料2" },
            { 3023, "ゼナアドの記録資料3" },
            { 3024, "ゼナアドの記録資料4" },
            { 3025, "ゼナアドの記録資料5" },
            { 3026, "ゼナアドの記録資料6" },
            { 3027, "ゼナアドの記録資料7" },
            { 3028, "ゼナアドの記録資料8" },
            { 3029, "ゼナアドの記録資料9" },
            { 3030, "ゼナアドの記録資料10" }
        };
    }
}
