using System.Collections.Generic;

namespace Siasm
{
    public class ItemOfDescriptionMasterData
    {
        /// <summary>
        /// TODO: マスターメモリーでの管理に以降予定
        /// </summary>
        public Dictionary<int, string> DescriptionDictionary = new Dictionary<int, string>()
        {
            // 1000番台
            { 1001, "全社内ツールにアクセス可能なデバイスで入社時に配布された\n正式名称はアームtoブレイン\n身体から出る微弱なシグナルを読み取ることで第3のうでのように扱えるらしい" },
            { 1002, "ラボに入るために必要なセキュリティキー\n研究所では様々なクリシェミナを調査している\n\n調査した情報を基にAtoBデバイスやSelなど様々な機器の開発を行っている" },
            { 1003, "クリシェミナ社が開発した携帯型の高濃度酸素吸入器\n薬物反応や周りへの害などもないため非常に安全で、且つ効率的にパフォーマンスを向上させることができる\nクリシェミナ社の主な収入源で老若男女に人気のアイテムとして普及している" },
            { 1004, "AtoBデバイス拡張\n[収容記録][ステータス][外観][リワード][名刺]の機能を追加する" },
            // 2000番台
            { 2001, "クリシェミナから採取した結晶\n最初は液体だったが時間がたつにつれて結晶となった\n青白い光を放ちほんのり温かみを感じる\n\nクリシェミナを破壊した際に飛び散ったところを見ると彼らを構成している物質の一つのようだ" },
            { 2002, "数に応じてパッシブコストを増加させる\n無機物に有機物が混じったかような緑色の結晶体\n\n集めた結晶はAtoBデバイスの性能を向上させることが可能で、デバイスを通じて脳の拡張や操作を直感的に操作できるようだ" },
            // 3000番台
            // 自社関係
            { 3001, "クリシェミナ社の歴史資料1" },
            { 3002, "クリシェミナ社の歴史資料2" },
            { 3003, "クリシェミナ社の歴史資料3" },
            { 3004, "クリシェミナ社の歴史資料4" },
            { 3005, "クリシェミナ社の歴史資料5" },
            { 3006, "クリシェミナ社の歴史資料6" },
            { 3007, "クリシェミナ社の歴史資料7" },
            { 3008, "クリシェミナ社の歴史資料8" },
            { 3009, "クリシェミナ社の歴史資料9" },
            { 3010, "クリシェミナ社の歴史資料10" }
        };
    }
}
